inventory_service_perf/wrk_report/inventory_python310_write_900.txt
Running 2m test @ http://eniac-bench:8080
  1 threads and 100 connections
  Thread calibration: mean lat.: 69.727ms, rate sampling interval: 202ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   127.84ms  154.22ms   1.38s    90.75%
    Req/Sec     0.90k   100.50     1.13k    74.35%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   80.45ms
 75.000%  117.50ms
 90.000%  257.15ms
 99.000%  785.41ms
 99.900%    1.07s 
 99.990%    1.30s 
 99.999%    1.36s 
100.000%    1.38s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      10.311     0.000000            1         1.00
      38.783     0.100000         9875         1.11
      51.071     0.200000        19751         1.25
      61.343     0.300000        29580         1.43
      71.039     0.400000        39474         1.67
      80.447     0.500000        49299         2.00
      84.927     0.550000        54218         2.22
      89.727     0.600000        59193         2.50
      94.719     0.650000        64099         2.86
     101.375     0.700000        69009         3.33
     117.503     0.750000        73937         4.00
     127.039     0.775000        76404         4.44
     135.167     0.800000        78876         5.00
     144.127     0.825000        81349         5.71
     156.287     0.850000        83807         6.67
     180.479     0.875000        86268         8.00
     214.015     0.887500        87490         8.89
     257.151     0.900000        88721        10.00
     315.135     0.912500        89953        11.43
     395.775     0.925000        91185        13.33
     466.431     0.937500        92419        16.00
     492.287     0.943750        93033        17.78
     518.911     0.950000        93653        20.00
     552.447     0.956250        94274        22.86
     588.799     0.962500        94890        26.67
     623.615     0.968750        95504        32.00
     638.975     0.971875        95810        35.56
     658.943     0.975000        96121        40.00
     680.447     0.978125        96426        45.71
     702.463     0.981250        96732        53.33
     730.623     0.984375        97045        64.00
     743.935     0.985938        97193        71.11
     759.295     0.987500        97346        80.00
     775.167     0.989062        97502        91.43
     793.087     0.990625        97655       106.67
     811.007     0.992188        97812       128.00
     820.735     0.992969        97890       142.22
     833.535     0.993750        97962       160.00
     846.847     0.994531        98039       182.86
     862.719     0.995313        98117       213.33
     886.783     0.996094        98194       256.00
     895.487     0.996484        98232       284.44
     905.215     0.996875        98270       320.00
     919.039     0.997266        98309       365.71
     941.055     0.997656        98347       426.67
     970.239     0.998047        98386       512.00
     989.183     0.998242        98405       568.89
    1009.151     0.998437        98424       640.00
    1029.631     0.998633        98444       731.43
    1054.719     0.998828        98463       853.33
    1072.127     0.999023        98483      1024.00
    1089.535     0.999121        98492      1137.78
    1104.895     0.999219        98501      1280.00
    1119.231     0.999316        98511      1462.86
    1131.519     0.999414        98521      1706.67
    1156.095     0.999512        98530      2048.00
    1173.503     0.999561        98535      2275.56
    1183.743     0.999609        98541      2560.00
    1192.959     0.999658        98545      2925.71
    1231.871     0.999707        98550      3413.33
    1249.279     0.999756        98554      4096.00
    1260.543     0.999780        98557      4551.11
    1270.783     0.999805        98559      5120.00
    1283.071     0.999829        98562      5851.43
    1292.287     0.999854        98564      6826.67
    1295.359     0.999878        98566      8192.00
    1304.575     0.999890        98568      9102.22
    1317.887     0.999902        98569     10240.00
    1318.911     0.999915        98570     11702.86
    1326.079     0.999927        98571     13653.33
    1327.103     0.999939        98572     16384.00
    1329.151     0.999945        98573     18204.44
    1333.247     0.999951        98574     20480.00
    1333.247     0.999957        98574     23405.71
    1337.343     0.999963        98575     27306.67
    1337.343     0.999969        98575     32768.00
    1346.559     0.999973        98576     36408.89
    1346.559     0.999976        98576     40960.00
    1346.559     0.999979        98576     46811.43
    1360.895     0.999982        98577     54613.33
    1360.895     0.999985        98577     65536.00
    1360.895     0.999986        98577     72817.78
    1360.895     0.999988        98577     81920.00
    1360.895     0.999989        98577     93622.86
    1378.303     0.999991        98578    109226.67
    1378.303     1.000000        98578          inf
#[Mean    =      127.835, StdDeviation   =      154.216]
#[Max     =     1377.280, Total count    =        98578]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  107101 requests in 2.00m, 19.00MB read
Requests/sec:    892.32
Transfer/sec:    162.08KB