inventory_service_perf/wrk_report/inventory_python311_initial_fill_1k.txt
next_player_id is achive 100000 and reset to 1
next_player_id is achive 100000 and reset to 1
next_player_id is achive 100000 and reset to 1
[...]
Running 10m test @ http://eniac-bench:8080
  1 threads and 100 connections
  Thread calibration: mean lat.: 15.084ms, rate sampling interval: 69ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    42.13ms   70.38ms 836.61ms   89.68%
    Req/Sec     1.01k   132.04     1.35k    72.71%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   13.15ms
 75.000%   38.30ms
 90.000%  116.29ms
 99.000%  345.34ms
 99.900%  523.78ms
 99.990%  672.77ms
 99.999%  759.81ms
100.000%  837.12ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       3.343     0.000000            1         1.00
       6.643     0.100000        58963         1.11
       8.147     0.200000       118010         1.25
       8.759     0.300000       177631         1.43
       9.543     0.400000       235947         1.67
      13.151     0.500000       294846         2.00
      15.415     0.550000       324311         2.22
      18.527     0.600000       353884         2.50
      21.311     0.650000       383249         2.86
      28.671     0.700000       412695         3.33
      38.303     0.750000       442149         4.00
      44.767     0.775000       456889         4.44
      54.015     0.800000       471615         5.00
      64.543     0.825000       486391         5.71
      77.055     0.850000       501121         6.67
      93.055     0.875000       515852         8.00
     103.679     0.887500       523217         8.89
     116.287     0.900000       530569        10.00
     134.527     0.912500       537954        11.43
     158.591     0.925000       545327        13.33
     179.199     0.937500       552702        16.00
     189.439     0.943750       556379        17.78
     200.959     0.950000       560047        20.00
     214.271     0.956250       563728        22.86
     229.119     0.962500       567409        26.67
     244.863     0.968750       571109        32.00
     253.567     0.971875       572958        35.56
     262.399     0.975000       574804        40.00
     273.663     0.978125       576622        45.71
     288.767     0.981250       578478        53.33
     306.687     0.984375       580306        64.00
     316.927     0.985938       581239        71.11
     326.911     0.987500       582169        80.00
     338.175     0.989062       583072        91.43
     350.719     0.990625       583997       106.67
     366.591     0.992188       584920       128.00
     376.319     0.992969       585372       142.22
     386.047     0.993750       585837       160.00
     396.543     0.994531       586298       182.86
     409.343     0.995313       586759       213.33
     423.935     0.996094       587216       256.00
     432.383     0.996484       587443       284.44
     441.599     0.996875       587673       320.00
     452.351     0.997266       587908       365.71
     462.335     0.997656       588134       426.67
     474.879     0.998047       588365       512.00
     481.535     0.998242       588480       568.89
     488.959     0.998437       588596       640.00
     498.175     0.998633       588711       731.43
     511.743     0.998828       588826       853.33
     526.335     0.999023       588940      1024.00
     534.527     0.999121       588997      1137.78
     543.743     0.999219       589058      1280.00
     553.983     0.999316       589113      1462.86
     565.759     0.999414       589171      1706.67
     578.559     0.999512       589229      2048.00
     585.215     0.999561       589257      2275.56
     592.383     0.999609       589288      2560.00
     600.063     0.999658       589314      2925.71
     608.767     0.999707       589344      3413.33
     620.031     0.999756       589372      4096.00
     626.687     0.999780       589386      4551.11
     634.367     0.999805       589401      5120.00
     645.119     0.999829       589416      5851.43
     655.871     0.999854       589430      6826.67
     663.551     0.999878       589444      8192.00
     667.135     0.999890       589452      9102.22
     673.279     0.999902       589458     10240.00
     678.399     0.999915       589465     11702.86
     686.591     0.999927       589472     13653.33
     696.319     0.999939       589480     16384.00
     698.879     0.999945       589483     18204.44
     703.999     0.999951       589487     20480.00
     706.047     0.999957       589490     23405.71
     711.167     0.999963       589494     27306.67
     723.967     0.999969       589498     32768.00
     728.063     0.999973       589499     36408.89
     737.791     0.999976       589501     40960.00
     744.959     0.999979       589503     46811.43
     751.103     0.999982       589505     54613.33
     754.687     0.999985       589507     65536.00
     754.687     0.999986       589507     72817.78
     756.735     0.999988       589508     81920.00
     759.807     0.999989       589509     93622.86
     783.871     0.999991       589510    109226.67
     786.431     0.999992       589511    131072.00
     786.431     0.999993       589511    145635.56
     793.599     0.999994       589512    163840.00
     793.599     0.999995       589512    187245.71
     813.055     0.999995       589513    218453.33
     813.055     0.999996       589513    262144.00
     813.055     0.999997       589513    291271.11
     813.567     0.999997       589514    327680.00
     813.567     0.999997       589514    374491.43
     813.567     0.999998       589514    436906.67
     813.567     0.999998       589514    524288.00
     813.567     0.999998       589514    582542.22
     837.119     0.999998       589515    655360.00
     837.119     1.000000       589515          inf
#[Mean    =       42.133, StdDeviation   =       70.380]
#[Max     =      836.608, Total count    =       589515]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  599796 requests in 10.00m, 106.39MB read
Requests/sec:    999.65
Transfer/sec:    181.58KB